/*************************************************************************************
作用：该属性只能用于带有数值类型参数的函数上。
当重复调用带有数值参数的函数时，由于返回值是相同的，所以此时编译器可以进行优化处理，
除第一次需要运算外， 其它只需要返回第一次的结果就可以了，进而可以提高效率。
该属性主要适用于没有静态状态（static state）和副作用的一些函数，并且返回值仅仅依赖输入的参数。

用法：
__attribute__((const))

注意:
const参数不能用在带有指针类型参数的函数中，因为该属性不但影响函数的参数值，同样也影响到了参数指向的数据，
它可能会对代码本身产生严重甚至是不可恢复的严重后果。
并且，带有该属性的函数不能有任何副作用或者是静态的状态，
所以，类似getchar（）或time（）的函数是不适合使用该属性的。

这个属性在编译时给gcc加一个-O的参数才可以生效。
**************************************************************************************/

#include "stdio.h"
#include "inttypes.h"


int  __attribute__((const)) add(int x)
{
    printf("%s(%d)\n", __FUNCTION__, x);
    return x + 1;
}
 
int  add2(int x)
{
    printf("%s(%d)\n", __FUNCTION__, x);
    return x + 1;
}
 
int main(int argc, char* argv[])
{
    int i, j;
 
    i = add(10);
    j = add(10);
 
    printf("%d %d\n", i, j);
 
    i = add2(10);
    j = add2(10);
 
    printf("%d %d\n", i, j);
 
    return 0;
}

